Repository: WesleyNog/pkmtcgcollector
Catalog: lib/l10n/app_*.arb
Languages: pt

# language
source: english
pt: português

# colectionLabel
source: Collection
pt: Coleção

# pkmList
source: List of Pokémon
pt: Lista de Pokémon

# placeholders
source: Search Pokémon
pt: Buscar Pokémon

# codeLabel
source: Code
pt: Cód

# nameLabel
source: Name
pt: Nome

# rarityLabel
source: Rarity
pt: Raridade

source: Rate
pt: Taxas

# busterPack
source: Pack
pt: Buster

source: Clear
pt: Limpar

# totalsLabel
source: Totals
pt: Totais

# allLabel
source: All
pt: Todos

# bestPackLabel
source: Best Pack
pt: Melhor Buster

# newCards
source: Chance (%) - New Cards
pt: Chance (%) - Novas Cartas

# mew
source: Mew Tracker
pt: Caminho Mew

# help
source: Help / Guide
pt: Ajuda / Guia

# introHelp
source: Guide and Information
pt: Guia e Informação

# subIntroHelp
source: Everyone needs to know how the app works
pt: Todos precisam saber como funciona o app

# update
source: Updates
pt: Atualizações

# updateNote_0
source: Version 1.0.0 in 2025-01-01: Initial implementation of all features such as marking the cards you have and metrics on how close you are to completing the collection and/or challenges
pt: Versão 1.0.0 em 01/01/2025: Implementação inicial de todas as funcionalidades como marcação das carta que possui e métricas do quão próxima está para concluir a coleção e/ou os desafios

# info
source: Information
pt: Informação

# infoNote_0
source: Welcome to our Pokémon card collection management application! Here you can organize and track your letters in a practical and efficient way. Below, we explain how to use each available feature:
pt: Bem-vindo à nossa aplicação de gerenciamento de coleção de cartas Pokémon! Aqui você poderá organizar e acompanhar suas cartas de forma prática e eficiente. Abaixo, explicamos como utilizar cada funcionalidade disponível:

# infoNote_1
source: 1. Marking your Cards When accessing the card list, you will be able to view all the cards available in the official game. To mark a card as obtained, simply tap the check box next to the corresponding Pokémon. You can deselect at any time if you need to adjust your collection.
pt: 1. Marcando suas Cartas Ao acessar a lista de cartas, você poderá visualizar todas as cartas disponíveis no jogo oficial. Para marcar uma carta como obtida, basta tocar sobre a caixa de verificação ao lado do pokémon correspondente. Você pode desmarcar a qualquer momento caso precise ajustar sua coleção.

# infoNote_2
source: 2. Using Filters The list of cards can be filtered to facilitate your search. You can apply filters by: - Rarity: Select common, rare or legendary cards. - Collection Packs: Choose a specific set of cards. - Promo Cards: View only special promotional letters. These filters allow for more organized and faster navigation within the application.
pt: 2. Utilizando Filtros A lista de cartas pode ser filtrada para facilitar sua busca. Você pode aplicar filtros por: - Raridade: Selecione cartas comuns, raras ou lendárias. - Pacotes de Coleção: Escolha um conjunto específico de cartas. - Cartas Promocionais: Visualize apenas as cartas promocionais especiais. Esses filtros permitem uma navegação mais organizada e rápida dentro do aplicativo.

# infoNote_3
source: 3. Tracking Collection Progress The application provides a metrics screen where you can view your collection progress through interactive graphs. On this screen you will find: - Percentage of Busters Obtained: A graph displaying the percentage of cards you have already collected in relation to the total available. - Challenges: Some personalized missions to encourage your collection, such as obtaining the MEW card in the first collection, among others.
pt: 3. Acompanhando o Progresso da Coleção A aplicação disponibiliza uma tela de métricas onde você pode visualizar seu progresso na coleção através de gráficos interativos. Nessa tela, você encontrará: - Porcentagem de Busters Obtidos: Um gráfico exibindo o percentual de cartas que você já coletou em relação ao total disponível. - Desafios: Algumas missões personalizadas para incentivar sua coleção, como a obtenção da carta MEW na primeira coleção dentre outras mais.

# infoNote_4
source: Extra Tips - Keep your collection up to date to accurately track your progress. - Use the filters to quickly find the cards you need. - Check back frequently for challenges to motivate your search for new cards.
pt: Dicas Extras - Mantenha sua coleção sempre atualizada para acompanhar com precisão seu progresso. - Utilize os filtros para encontrar rapidamente as cartas que precisa. - Verifique frequentemente os desafios para motivar sua busca por novas cartas.
